export const DEFAULT_RULES_TEXT = `나무클랜 개인팀리그 규정

1.리그 진행 방식
 1) 총 3개의 라운드, 총 9주차동안 진행한다. (3주차 당 1라운드로 간주한다.)

 2) 1,2,3라운드 모두 개인전으로만 진행을 하며, 세트 별 티어구간 및 단일 티어 경기(운영진 사전 지정 "지정티어경기"로 통칭)가 혼합된다.
※ 세트구성	1~2티어 / 2~3티어 / 3~4티어 / 4~5티어 / 운영진 사전 지정 티어 2세트 / 에결로 구성된다
※ 세트 티어구간 출전 조항
"  티어 구간 별 세트에서 상위티어(세트 상 앞숫자 티어)의 출전이 가능한 세트는 최대 2개의 세트이고 나머지 세트에 대해선 하위티어가 의무적으로 출전해야 한다.
   예) 1~2티어 구간에 1티어 선수 출전 시 , 2~3티어구간 / 3~4티어 구간/ 4~5티어 구간 중 2개의 세트에 대해선 의무적으로 하위티어 출전을 해야 한다.
   "
※ 에이스결정전의 경우 1,2,3,4 네개의 티어를 기준으로 당일 경기전 추첨을 통해 정한다. (맵 및 티어)

 3) 결승전의 경우 총 2회에 걸쳐 진행되며, 결승 1,2차전의 승자가 다를 경우 단판 슈퍼에이스 결정전을 통해 최종 승자를 가린다.

 4) 리그 진행 맵
  개인전 : 폴리포이드,폴스타,녹아웃,옥타곤,애티튜드,매치포인트,네오실피드 (리그 진행 중 래더 맵 변경이 발생한 경우, 변경 시점에 따라 리그 맵이 변경될 수 있다.)

 5) 경기진행 시각 : 매주 화,목 21:00에 진행한다. (단, 공휴일 등 리그 진행이 불가능하다고 판단되는 경우 일부 일정의 조정이 있을 수 있다.)

 6) 순위 산정 방식은 아래와 같은 기준으로 진행한다.
    승점 > 승패 > 팀 승자승을 기준으로 진행한다.

 7) 승점 및 가산점은 다음과 같이 부여된다.
        승리 시 : 기본 승점 3점 부여, 6:0 승리시 추가 1점 부여
        패배 시 : 에이스결정전에서 패배할 경우에만 1점의 승점을 부여한다.
        공통 : 6인 엔트리 구성 시 +1점을 부여한다. 4~5티어 구간에 5티어 선수를 출전시킨 경우 +1점을 부여한다. (엔트리 등록 및 출전까지 마친경우(선수교체로 인한것은 무효로 한다.)

※ 리그 진행 점수 총정리
        기본 승리시 승점 +3점 / 6인엔트리 가산점 +1점 / 6:0 승리시 +1점 /
※ 엔트리 구성에 따른 가산점(6인)의 경우, 엔트리 제출 후 실제 경기까지 이뤄졌을 때를 가정한다. 엔트리 제출 후 인원변동이 발생하여 변경한 경우엔 위 규정을 적용하지 않는다.
※ 가산점이 무효가 되는 예) 엔트리 공개 이후, 변경되는 경우(경기시작전 뿐 아니라 경기중 변경이 다 포함된다.) / 엔트리 선공개(양팀합의하 공개시점 이전 공개) 이후 변경건

  8) 엔트리는 경기시작 2시간 전 까지 경기 진행 BJ에게 제출을 원칙으로 하며, 양팀 합의하에 제출 시간 이전 선공개가 가능하다.

  9) 순위 및 승점은 승점>승패>승자승의 순으로 정한다.

10) 본 리그 모든 방송경기의 경우 , 공정한 경쟁을 목적으로 전 경기 19금 방송을 기본으로 진행한다.

2. 참여선수 기본 규칙
 1) 반드시 클랜 공식 ID 및 팀 ID로만 참여가 가능하다. (아이디 생성등의 이슈로 인해 아이디 뒤에 숫자 등이 표기된 경우도 허용한다.)

 2) 방 생성 후 5분 내 입장을 원칙으로 하며, 양 팀간 사전 협의 없이 기준 시간을 위반할 경우 해당 경기는 부전패 처리 한다.

 3) 경기 진행 중 부득이한 사유로 엔트리의 변경이 필요한 경우 양 팀장 협의하에 변경 후 경기 진행이 가능하다. 상대 측에서 거부 의사를 밝히는 경우에는 즉시 기권패 처리한다.
(교체조건 : 동일티어 동일종족/ 하위티어 모든종족)
 4) 참여선수 출전 횟수 관련
   - 정규리그 중 개인전 총 출전횟수는 제한이 없다.
   - 기본 구성티어 (1~2 / 2~3 / 3~4 / 4~5) 와 지정티어경기간에 대해서만 중복이 가능하다.

예) 2~3 티어에 출전한 경우 / 추가 구성세트에 대해서는 출전가능하나 , 1~2,3~4등 지정된 구간에서는 출전이 불가능하다.

3. 경기진행 내부 규정
   1) 경기 중 부득이하게 일시 중단을 해야 하는 경우 PP를 포함한 중단 의사를 밝힌 뒤 직접 퍼즈를 건다. (홈&어웨이 방식의 경우 BJ가 직접 퍼즈를 거는 것이 불가능하기 때문이다.)

   2) 게임 중 네트워크 이슈가 발생하는 경우 기본적으로 재경기를 진행하지만, 유불리가 명확한 상황이라고 판단되는 경우 리그 운영진 판단하에 우세승 기준을 적용한다
※ 방송 진행자의 네트워크 이슈가 발생한 경우, 경기 선수들의 이슈가 없는 경우라면 경기 속행 후 추후 리플레이 등을 통해 경기 결과를 확인한다. (단, 극초반 상황등의 경우 재경기가 가능하다.)

   3) 경기 중 비매너성 플레이(방플,대리,경기 밸런스에 영향을 끼칠만한 불법 프로그램 사용 등)이 적발될경우, 해당 경기는 몰수패 처리를 하며 해당 선수는 즉각 중징계에 처한다.

   4) 그 외 경기 내 상대로 하여금 불쾌함을 유발할 수 있는 플레이를 금지한다. 해당 플레이의 상황 및 정도에 따라 해당 선수에 대한 징계처분을 할 수 있다.
   5) 경기 진행자가 방을 생성한 뒤, 5분내 입장을 하여야 하며 5분 이상 지연될 경우 해당 세트는 부전패 처리한다.

4. 플레이오프 및 결승 규정
- 정규시즌 1위는 결승전에 직행하며, 2위와 3위의 플레이오프를 통해 결승전 상대를 결정한다.
- 정규리그 상위팀의 경우 플레이오프 및 결승전에 있어 추가 구성티어(지정티어) 2개에 대한 티어와 맵 선택권을 가진다.
- 상위팀이 정하는 2개의 지정티어는 동일티어와 맵으로 낼 순 없다.
- 플레이오프 최대 출전 가능횟수는 최대 2회이며, 정규시즌 규정에 따른 기본구성티어와 지정티어간 중복만 가능하다.
- 결승은 총 2회로 치뤄지며 결승 1차전과 2차전의 승자가 각각 다른 경우 단판 슈퍼에이스결정전을 통해 최종 우승을 가린다.
- 결승의 경우 총 출전 가능 경기수를 3회로 제한한다.(1,2차전 총합기준이며,3회라고 하여 1차전 또는 2차전에 하루만에 총 3코인을 사용가능하다는 의미는 아니다.)`;
